@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
File "flash:/c3560-advipservicesk9-mz.122-40.SE.bin" uncompressed and installed, entry point: 0x3000
executing...

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, C3560 Software (C3560-ADVIPSERVICESK9-M), Version 12.2(40)SE, RELEASE SOFTWARE (fc3)
Copyright (c) 1986-2007 by Cisco Systems, Inc.
Compiled Fri 24-Aug-07 01:43 by myl
Image text-base: 0x00003000, data-base: 0x01800000

Initializing flashfs...

flashfs[1]: 355 files, 5 directories
flashfs[1]: 0 orphaned files, 0 orphaned directories
flashfs[1]: Total bytes: 15998976
flashfs[1]: Bytes used: 11380736
flashfs[1]: Bytes available: 4618240
flashfs[1]: flashfs fsck took 7 seconds.
flashfs[1]: Initialization complete....done Initializing flashfs.

POST: CPU MIC register Tests : Begin
POST: CPU MIC register Tests : End, Status Passed

POST: PortASIC Memory Tests : Begin
POST: PortASIC Memory Tests : End, Status Passed

POST: CPU MIC interface Loopback Tests : Begin
POST: CPU MIC interface Loopback Tests : End, Status Passed

POST: PortASIC RingLoopback Tests : Begin
POST: PortASIC RingLoopback Tests : End, Status Passed

POST: Inline Power Controller Tests : Begin
POST: Inline Power Controller Tests : End, Status Passed

POST: PortASIC CAM Subsystem Tests : Begin
POST: PortASIC CAM Subsystem Tests : End, Status Passed

POST: PortASIC Port Loopback Tests : Begin
POST: PortASIC Port Loopback Tests : End, Status Passed

Waiting for Port download...Complete


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C3560-24PS (PowerPC405) processor (revision P0) with 122880K/8184K bytes of memory.
Processor board ID CAT1025ZJ76
Last reset from power-on
1 Virtual Ethernet interface
24 FastEthernet interfaces
2 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00:18:73:D2:55:80
Motherboard assembly number     : 73-9673-09
Power supply part number        : 341-0029-05
Motherboard serial number       : CAT1025051E
Power supply serial number      : DTH1020DG4A
Model revision number           : P0
Motherboard revision number     : A0
Model number                    : WS-C3560-24PS-E
System serial number            : CAT1025ZJ76
Top Assembly Part Number        : 800-26380-04
Top Assembly Revision Number    : B0
Version ID                      : V06
CLEI Code Number                : COM1100ARC
Hardware Board Revision Number  : 0x01


Switch   Ports  Model              SW Version              SW Image            
------   -----  -----              ----------              ----------          
*    1   26     WS-C3560-24PS      12.2(40)SE              C3560-ADVIPSERVICESK




Press RETURN to get started!


00:00:35: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to down
00:00:36: %SPANTREE-5-EXTENDED_SYSID: Extended SysId enabled for type vlan
00:00:58: %SYS-5-RESTART: System restarted --
Cisco IOS Software, C3560 Software (C3560-ADVIPSERVICESK9-M), Version 12.2(40)SE, RELEASE SOFTWARE (fc3)
Copyright (c) 1986-2007 by Cisco Systems, Inc.
Compiled Fri 24-Aug-07 01:43 by myl
00:01:03: %LINK-3-UPDOWN: Interface GigabitEthernet0/1, changed state to up
00:01:03: %LINK-3-UPDOWN: Interface GigabitEthernet0/2, changed state to up
00:01:03: %LINK-3-UPDOWN: Interface FastEthernet0/11, changed state to up
00:01:04: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up
00:01:04: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/2, changed state to up
00:01:04: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/11, changed state to up


         --- System Configuration Dialog ---

Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>enable
Switch#conf t
00:01:28: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively down
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname Switch31
Switch31(config)#enable password cisco
Switch31(config)#line con 0
Switch31(config-line)#password cisco
Switch31(config-line)#login
Switch31(config-line)#logging sync
Switch31(config-line)#logging synchronous 
Switch31(config-line)#line vty 0 4
Switch31(config-line)#password cisco
Switch31(config-line)#login
Switch31(config-line)#logging sync
Switch31(config-line)#logging synchronous 
Switch31(config-line)#int vlan 1
Switch31(config-if)#ip address 17
00:02:46: %LINK-3-UPDOWN: Interface FastEthernet0/16, changed state to up
00:02:46: %LINK-3-UPDOWN: Interface FastEthernet0/15, changed state to up
00:02:47: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/16, changed state to up
Switch31(config-if)#ip address 172.
00:02:47: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/15, changed state to up
Switch31(config-if)#ip address 172.19.1.11 255.255.255.0
Switch31(config-if)#no shutdown
Switch31(config-if)#
00:03:15: %LINK-3-UPDOWN: Interface Vlan1, changed state to up
00:03:16: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
Switch31(config-if)#vtp domain INETLAB
Changing VTP domain name from NULL to INETLAB
Switch31(config)#
00:04:13: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to INETLAB.
Switch31(config)#vtp password cisco
Setting device VLAN database password to cisco
Switch31(config)#vtp mode server
Device mode already VTP SERVER.
Switch31(config)#int range g0/1, g0/2, f0/15, f0/16. f0/23
                                                    ^
% Invalid input detected at '^' marker.

Switch31(config)#int range g0/1, g0/2, f0/15, f0/16, f0/23  
Switch31(config-if-range)#switchport trunk encapsul
Switch31(config-if-range)#switchport trunk encapsulation dot1q
Switch31(config-if-range)#switchport mode trunk
Switch31(config-if-range)#
00:06:31: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to down
00:06:31: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/2, changed state to down
00:06:31: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/15, changed state to down
00:06:31: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/16, changed state to down
Switch31(config-if-range)#
00:06:34: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up
00:06:34: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/2, changed state to up
00:06:34: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/15, changed state to up
00:06:34: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/16, changed state to up
Switch31(config-if-range)#switchport access
00:06:38: %SW_VLAN-4-VTP_USER_NOTIFICATION: VTP protocol user notification: MD5 digest checksum mismatch on receipt of equal revision summary on trunk: Gi0/1 

00:06:38: %SW_VLAN-4-VTP_USER_NOTIFICATION: VTP protocol user notification: MD5 digest checksum mismatch on receipt of equal revision summary on trunk: Gi0/2 

Switch31(config-if-range)#switchport mode access
Switch31(config-if-range)#^Z                    
Switch31#
00:07:22: %SYS-5-CONFIG_I: Configured from console by console
Switch31#vlan  
00:08:07: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/11, changed state to down
00:08:08: %LINK-3-UPDOWN: Interface FastEthernet0/11, changed state to down
Switch31#vlan
00:09:11: %LINK-3-UPDOWN: Interface FastEthernet0/23, changed state to up
00:09:12: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/23, changed state to up
Switch31#vlan
00:09:14: %SPANTREE-7-RECV_1Q_NON_TRUNK: Received 802.1Q BPDU on non trunk FastEthernet0/23 VLAN1.
00:09:14: %SPANTREE-7-BLOCK_PORT_TYPE: Blocking FastEthernet0/23 on VLAN0001. Inconsistent port type.
Switch31#vlan
00:09:23: %LINK-3-UPDOWN: Interface FastEthernet0/11, changed state to up
Switch31#vlan
00:09:24: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/11, changed state to up
Switch31#vlan
00:09:29: %SPANTREE-2-UNBLOCK_CONSIST_PORT: Unblocking FastEthernet0/23 on VLAN0001. Port consistency restored.
Switch31#vlan 100
              ^
% Invalid input detected at '^' marker.

Switch31#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch31(config)#vlan 100
Switch31(config-vlan)#name BLUE
Switch31(config-vlan)#^Z
Switch31#conf t
00:11:07: %SYS-5-CONFIG_I: Configured from console by console
Switch31#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch31(config)#int range g0/1, g0/2, f0/15, f0/16, f0/23
Switch31(config-if-range)#switchport mode access
Switch31(config-if-range)#switchport access vlan 100
Switch31(config-if-range)#^Z
Switch31#conf t
00:11:48: %SYS-5-CONFIG_I: Configured from console by console
Switch31#conf t 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch31(config)#
00:11:51: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on FastEthernet0/15 (100), with Switch32 FastEthernet0/16 (1).
00:11:51: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on FastEthernet0/16 (100), with Switch32 FastEthernet0/15 (1).
Switch31(config)#vlan 
00:11:54: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on GigabitEthernet0/1 (100), with switch3 GigabitEthernet0/1 (1).
00:11:54: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on GigabitEthernet0/2 (100), with switch3 GigabitEthernet0/2 (1).
Switch31(config)#vlan 200
Switch31(config-vlan)#name RED
Switch31(config-vlan)#
00:11:58: %SPANTREE-7-RECV_1Q_NON_TRUNK: Received 802.1Q BPDU on non trunk FastEthernet0/23 VLAN100.
00:11:58: %SPANTREE-7-BLOCK_PORT_TYPE: Blocking FastEthernet0/23 on VLAN0100. Inconsistent port type.
Switch31(config-vlan)#
00:11:59: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on FastEthernet0/23 (100), with Switch34 FastEthernet0/23 (1).
Switch31(config-vlan)#                                         
00:12:51: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on FastEthernet0/15 (100), with Switch32 FastEthernet0/16 (1).
00:12:51: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on FastEthernet0/16 (100), with Switch32 FastEthernet0/15 (1).
Switch31(config-vlan)#
00:12:54: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on GigabitEthernet0/1 (100), with switch3 GigabitEthernet0/1 (1).
00:12:54: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on GigabitEthernet0/2 (100), with switch3 GigabitEthernet0/2 (1).
Switch31(config-vlan)#
00:12:59: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on FastEthernet0/23 (100), with Switch34 FastEthernet0/23 (1).
Switch31(config-vlan)#int range g0/1, g0/2, f0/15, f0/16, f0/23
Switch31(config-if-range)#no switchport access vlan 100
Switch31(config-if-range)#
00:13:35: %SPANTREE-7-RECV_1Q_NON_TRUNK: Received 802.1Q BPDU on non trunk FastEthernet0/23 VLAN1.
00:13:35: %SPANTREE-7-BLOCK_PORT_TYPE: Blocking FastEthernet0/23 on VLAN0001. Inconsistent port type.
Switch31(config-if-range)#sh vlan
                             ^
% Invalid input detected at '^' marker.

Switch31(config-if-range)#^Z
Switch31#sh vl
00:13:41: %SYS-5-CONFIG_I: Configured from console by console
Switch31#sh vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
                                                Gi0/1, Gi0/2
100  BLUE                             active    
200  RED                              active    
1002 fddi-default                     act/unsup 
1003 token-ring-default               act/unsup 
1004 fddinet-default                  act/unsup 
1005 trnet-default                    act/unsup 

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        0      0   
100  enet  100100     1500  -      -      -        -    -        0      0   
200  enet  100200     1500  -      -      -        -    -        0      0   
1002 fddi  101002     1500  -      -      -        -    -        0      0   
          
VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1003 tr    101003     1500  -      -      -        -    -        0      0   
1004 fdnet 101004     1500  -      -      -        ieee -        0      0   
1005 trnet 101005     1500  -      -      -        ibm  -        0      0   

Remote SPAN VLANs
------------------------------------------------------------------------------


Primary Secondary Type              Ports
------- --------- ----------------- ------------------------------------------

Switch31#
00:13:50: %SPANTREE-2-UNBLOCK_CONSIST_PORT: Unblocking FastEthernet0/23 on VLAN0001. Port consistency restored.
Switch31#sh run
Building configuration...

Current configuration : 1679 bytes
!
version 12.2
no service pad
service timestamps debug uptime
service timestamps log uptime
no service password-encryption
!
hostname Switch31
!
enable password cisco
!
no aaa new-model
system mtu routing 1500
ip subnet-zero
!
!
!
!
!
!
!
!         
!
spanning-tree mode pvst
spanning-tree extend system-id
!
vlan internal allocation policy ascending
!
!
!
!
interface FastEthernet0/1
!
interface FastEthernet0/2
!
interface FastEthernet0/3
!
interface FastEthernet0/4
!
interface FastEthernet0/5
!
interface FastEthernet0/6
!
interface FastEthernet0/7
!         
interface FastEthernet0/8
!
interface FastEthernet0/9
!
interface FastEthernet0/10
!
interface FastEthernet0/11
!
interface FastEthernet0/12
!
interface FastEthernet0/13
!
interface FastEthernet0/14
!
interface FastEthernet0/15
 switchport trunk encapsulation dot1q
 switchport mode access
!
interface FastEthernet0/16
 switchport trunk encapsulation dot1q
 switchport mode access
!
interface FastEthernet0/17
!
interface FastEthernet0/18
!
interface FastEthernet0/19
!
interface FastEthernet0/20
!
interface FastEthernet0/21
!
interface FastEthernet0/22
!
interface FastEthernet0/23
 switchport trunk encapsulation dot1q
 switchport mode access
!
interface FastEthernet0/24
!
interface GigabitEthernet0/1
 switchport trunk encapsulation dot1q
 switchport mode access
!
interface GigabitEthernet0/2
 switchport trunk encapsulation dot1q
 switchport mode access
!
interface Vlan1
 ip address 172.19.1.11 255.255.255.0
!
ip classless
ip http server
ip http secure-server
!
!
!
control-plane
!
!
line con 0
 password cisco
 logging synchronous
 login
line vty 0 4
 password cisco
 logging synchronous
 login
line vty 5 15
 login
!
end

Switch31#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch31(config)#int range g0/1, g0/2, f0/15, f0/16, f0/23
Switch31(config-if-range)#no switchport mode access
Switch31(config-if-range)#switchport mode trunk 
Switch31(config-if-range)#^Z
Switch31#sh run
00:15:37: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to down
00:15:37: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/2, changed state to down
00:15:37: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/15, changed state to down
00:15:37: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/16, changed state to down
00:15:37: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/23, changed state to down
00:15:37: 
Switch31#sh run
Building configuration...
%SYS-5-CONFIG_I: Configured from console by console
Current configuration : 1674 bytes
!
version 12.2
no service pad
service timestamps debug uptime
service timestamps log uptime
no service password-encryption
!
hostname Switch31
!
enable password cisco
!
no aaa new-model
system mtu routing 1500
ip subnet-zero
!
!
!
!
!
!
!
!         
!
spanning-tree mode pvst
spanning-tree extend system-id
!
vlan internal allocation policy ascending
!
!
!
!
interface FastEthernet0/1
!
interface FastEthernet0/2
!
interface FastEthernet0/3
!
interface FastEthernet0/4
!
interface FastEthernet0/5
!
interface FastEthernet0/6
!
interface FastEthernet0/7
 --More-- 
00:15:40: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up
00:15:40: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/2, changed state to up
00:15:40: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/15, changed state to up
00:15:40: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/16, changed state to up
00:15:40: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/23, changed state to up
!         
interface FastEthernet0/8
!
interface FastEthernet0/9
!
interface FastEthernet0/10
!
interface FastEthernet0/11
!
interface FastEthernet0/12
!
interface FastEthernet0/13
!
interface FastEthernet0/14
!
interface FastEthernet0/15
 switchport trunk encapsulation dot1q
 switchport mode trunk
!
interface FastEthernet0/16
 switchport trunk encapsulation dot1q
 switchport mode trunk
!
interface FastEthernet0/17
!
interface FastEthernet0/18
!
interface FastEthernet0/19
!
interface FastEthernet0/20
!
interface FastEthernet0/21
!
interface FastEthernet0/22
!
interface FastEthernet0/23
 switchport trunk encapsulation dot1q
 switchport mode trunk
!
interface FastEthernet0/24
!
interface GigabitEthernet0/1
 switchport trunk encapsulation dot1q
 switchport mode trunk
!
interface GigabitEthernet0/2
 switchport trunk encapsulation dot1q
 switchport mode trunk
!
interface Vlan1
 ip address 172.19.1.11 255.255.255.0
!
ip classless
ip http server
ip http secure-server
!
!
!
control-plane
!
!
line con 0
 password cisco
 logging synchronous
 login
line vty 0 4
 password cisco
 logging synchronous
 login
line vty 5 15
 login
!
end

Switch31#line vty 5 15
          ^
% Invalid input detected at '^' marker.

Switch31#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch31(config)#line vty 5 15
Switch31(config-line)#no login
Switch31(config-line)#^Z
Switch31#sh ruin
00:16:09: %SYS-5-CONFIG_I: Configured from console by console
Switch31#sh run 
Building configuration...

Current configuration : 1677 bytes
!
version 12.2
no service pad
service timestamps debug uptime
service timestamps log uptime
no service password-encryption
!
hostname Switch31
!
enable password cisco
!
no aaa new-model
system mtu routing 1500
ip subnet-zero
!
!
!
!
!
!
!
!         
!
spanning-tree mode pvst
spanning-tree extend system-id
!
vlan internal allocation policy ascending
!
!
!
!
interface FastEthernet0/1
!
interface FastEthernet0/2
!
interface FastEthernet0/3
!
interface FastEthernet0/4
!
interface FastEthernet0/5
!
interface FastEthernet0/6
!
interface FastEthernet0/7
!         
interface FastEthernet0/8
!
interface FastEthernet0/9
!
interface FastEthernet0/10
!
interface FastEthernet0/11
!
interface FastEthernet0/12
!
interface FastEthernet0/13
!
interface FastEthernet0/14
!
interface FastEthernet0/15
 switchport trunk encapsulation dot1q
 switchport mode trunk
!
interface FastEthernet0/16
 switchport trunk encapsulation dot1q
 switchport mode trunk
!
interface FastEthernet0/17
!
interface FastEthernet0/18
!
interface FastEthernet0/19
!
interface FastEthernet0/20
!
interface FastEthernet0/21
!
interface FastEthernet0/22
!
interface FastEthernet0/23
 switchport trunk encapsulation dot1q
 switchport mode trunk
!
interface FastEthernet0/24
!
interface GigabitEthernet0/1
 switchport trunk encapsulation dot1q
 switchport mode trunk
!
interface GigabitEthernet0/2
 switchport trunk encapsulation dot1q
 switchport mode trunk
!
interface Vlan1
 ip address 172.19.1.11 255.255.255.0
!
ip classless
ip http server
ip http secure-server
!
!
!
control-plane
!
!
line con 0
 password cisco
 logging synchronous
 login
line vty 0 4
 password cisco
 logging synchronous
 login
line vty 5 15
 no login
!
end

Switch31#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch31(config)#spanning-tr  
Switch31(config)#spanning-tree vlan 100 root primary
Switch31(config)#spanning-tree vlan 200 root primary
Switch31(config)#^Z
Switch31#
00:18:39: %SYS-5-CONFIG_I: Configured from console by console
Switch31#ping 172.19.1.13

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.19.1.13, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/2/8 ms
Switch31#ping 172.19.1.13

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.19.1.13, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/2/8 ms
Switch31#ping 172.19.1.12

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.19.1.12, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
Switch31#ping 172.19.1.12

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.19.1.12, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/2/8 ms
Switch31#ping 172.19.1.12

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.19.1.12, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/3/8 ms
Switch31#int f0/11
          ^
% Invalid input detected at '^' marker.

Switch31#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch31(config)#int f0/11
Switch31(config-if)#sh vlan
                       ^
% Invalid input detected at '^' marker.

Switch31(config-if)#do show vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/17, Fa0/18
                                                Fa0/19, Fa0/20, Fa0/21, Fa0/22
                                                Fa0/24
100  BLUE                             active    
200  RED                              active    
1002 fddi-default                     act/unsup 
1003 token-ring-default               act/unsup 
1004 fddinet-default                  act/unsup 
1005 trnet-default                    act/unsup 

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        0      0   
100  enet  100100     1500  -      -      -        -    -        0      0   
200  enet  100200     1500  -      -      -        -    -        0      0   
1002 fddi  101002     1500  -      -      -        -    -        0      0   
1003 tr    101003     1500  -      -      -        -    srb      0      0   
          
VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1004 fdnet 101004     1500  -      -      -        ieee -        0      0   
1005 trnet 101005     1500  -      -      -        ibm  -        0      0   

Remote SPAN VLANs
------------------------------------------------------------------------------


Primary Secondary Type              Ports
------- --------- ----------------- ------------------------------------------

Switch31(config-if)#

































Switch31 con0 is now available





Press RETURN to get started.













00:32:40: %SYS-5-CONFIG_I: Configured from console by console

User Access Verification

Password: 
Password: 
Switch31>sh vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/17, Fa0/18
                                                Fa0/19, Fa0/20, Fa0/21, Fa0/22
                                                Fa0/24
100  BLUE                             active    
200  RED                              active    
1002 fddi-default                     act/unsup 
1003 token-ring-default               act/unsup 
1004 fddinet-default                  act/unsup 
1005 trnet-default                    act/unsup 

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        0      0   
100  enet  100100     1500  -      -      -        -    -        0      0   
200  enet  100200     1500  -      -      -        -    -        0      0   
1002 fddi  101002     1500  -      -      -        -    -        0      0   
1003 tr    101003     1500  -      -      -        -    srb      0      0   
          
VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1004 fdnet 101004     1500  -      -      -        ieee -        0      0   
1005 trnet 101005     1500  -      -      -        ibm  -        0      0   

Remote SPAN VLANs
------------------------------------------------------------------------------


Primary Secondary Type              Ports
------- --------- ----------------- ------------------------------------------

Switch31>
01:05:14: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/11, changed state to down
01:05:15: %LINK-3-UPDOWN: Interface FastEthernet0/11, changed state to down
Switch31>ping 172.19.1.13

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.19.1.13, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/2/8 ms
Switch31>ping 172.19.1.11

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.19.1.11, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
Switch31>ping 172.19.1.12

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.19.1.12, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/4/9 ms
Switch31>ping 172.19.1.14

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.19.1.14, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/2/8 ms
Switch31>

































Switch31 con0 is now available





Press RETURN to get started.







User Access Verification

Password: 
Switch31>enable
Password: 
Switch31#int range g0/1, g0/2
          ^
% Invalid input detected at '^' marker.

Switch31#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch31(config)#int range g0/1, g0/2
Switch31(config-if-range)#channel-
Switch31(config-if-range)#channel-grou
Switch31(config-if-range)#channel-group ?
  <1-48>  Channel group number

Switch31(config-if-range)#channel-group 1 ?
  mode  Etherchannel Mode of the interface

Switch31(config-if-range)#channel-group 1 mode ?
  active     Enable LACP unconditionally
  auto       Enable PAgP only if a PAgP device is detected
  desirable  Enable PAgP unconditionally
  on         Enable Etherchannel only
  passive    Enable LACP only if a LACP device is detected

Switch31(config-if-range)#channel-group 1 mode active
Creating a port-channel interface Port-channel 1

Switch31(config-if-range)#
01:29:25: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to down
01:29:25: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/2, changed state to down
Switch31(config-if-range)#channel-pr
Switch31(config-if-range)#channel-protocol 
01:29:33: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up
01:29:33: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/2, changed state to up
Switch31(config-if-range)#channel-protocol LACP 
01:29:40: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to down
01:29:40: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/2, changed state to down
Switch31(config-if-range)#channel-protocol LACP
01:29:42: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up
01:29:43: %LINK-3-UPDOWN: Interface Port-channel1, changed state to up
Switch31(config-if-range)#channel-protocol LACP
Switch31(config-if-range)#
01:29:44: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/2, changed state to up
01:29:44: %LINEPROTO-5-UPDOWN: Line protocol on Interface Port-channel1, changed state to up
Switch31(config-if-range)#int po1 
Switch31(config-if-range)#int po 1
% Command exited out of interface range and its sub-modes.
  Not executing the command for second and later interfaces
Switch31(config-if)#switchport trunk encaps
Switch31(config-if)#switchport trunk encapsulation dot1q
Switch31(config-if)#switchport mode trunk
Switch31(config-if)#do show ether summary
Flags:  D - down        P - bundled in port-channel
        I - stand-alone s - suspended
        H - Hot-standby (LACP only)
        R - Layer3      S - Layer2
        U - in use      f - failed to allocate aggregator

        M - not in use, minimum links not met
        u - unsuitable for bundling
        w - waiting to be aggregated
        d - default port


Number of channel-groups in use: 1
Number of aggregators:           1

Group  Port-channel  Protocol    Ports
------+-------------+-----------+-----------------------------------------------
1      Po1(SU)         LACP      Gi0/1(P)    Gi0/2(P)    

Switch31(config-if)#^Z
Switch31#
01:35:59: %SYS-5-CONFIG_I: Configured from console by console
Switch31#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch31(config)#int range f0/15, f0/16
Switch31(config-if-range)#channel-gr
Switch31(config-if-range)#channel-group 2 mode active
Creating a port-channel interface Port-channel 2

Switch31(config-if-range)#chann
01:36:23: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/15, changed state to down
01:36:23: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/16, changed state to down
Switch31(config-if-range)#channel-protocal
Switch31(config-if-range)#channel-protocol
Switch31(config-if-range)#channel-protocol LACP
Switch31(config-if-range)#
01:36:31: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/16, changed state to up
01:36:32: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/15, changed state to up
Switch31(config-if-range)#int po 2
% Command exited out of interface range and its sub-modes.
  Not executing the command for second and later interfaces
Switch31(config-if)#Switchport trunk encaps
Switch31(config-if)#Switchport trunk encapsulation dot1q
Switch31(config-if)#switchport mode trunk
Switch31(config-if)#do show ether summary
Flags:  D - down        P - bundled in port-channel
        I - stand-alone s - suspended
        H - Hot-standby (LACP only)
        R - Layer3      S - Layer2
        U - in use      f - failed to allocate aggregator

        M - not in use, minimum links not met
        u - unsuitable for bundling
        w - waiting to be aggregated
        d - default port


Number of channel-groups in use: 2
Number of aggregators:           2

Group  Port-channel  Protocol    Ports
------+-------------+-----------+-----------------------------------------------
1      Po1(SU)         LACP      Gi0/1(P)    Gi0/2(P)    
2      Po2(SD)         LACP      Fa0/15(I)   Fa0/16(I)   

Switch31(config-if)#do show ether summary               
Flags:  D - down        P - bundled in port-channel
        I - stand-alone s - suspended
        H - Hot-standby (LACP only)
        R - Layer3      S - Layer2
        U - in use      f - failed to allocate aggregator

        M - not in use, minimum links not met
        u - unsuitable for bundling
        w - waiting to be aggregated
        d - default port


Number of channel-groups in use: 2
Number of aggregators:           2

Group  Port-channel  Protocol    Ports
------+-------------+-----------+-----------------------------------------------
1      Po1(SU)         LACP      Gi0/1(P)    Gi0/2(P)    
2      Po2(SD)         LACP      Fa0/15(I)   Fa0/16(I)   

Switch31(config-if)#int range f0/15, f0/16              
Switch31(config-if-range)#channel-group 2 mode active         
Switch31(config-if-range)#channel-protocol LACP               
Switch31(config-if-range)#int po 2                            
% Command exited out of interface range and its sub-modes.
  Not executing the command for second and later interfaces
Switch31(config-if)#switchport trunk encapsu   
Switch31(config-if)#switchport trunk encapsulation dot1q
Switch31(config-if)#switchport mode trunk
Switch31(config-if)#do show ether summary
Flags:  D - down        P - bundled in port-channel
        I - stand-alone s - suspended
        H - Hot-standby (LACP only)
        R - Layer3      S - Layer2
        U - in use      f - failed to allocate aggregator

        M - not in use, minimum links not met
        u - unsuitable for bundling
        w - waiting to be aggregated
        d - default port


Number of channel-groups in use: 2
Number of aggregators:           2

Group  Port-channel  Protocol    Ports
------+-------------+-----------+-----------------------------------------------
1      Po1(SU)         LACP      Gi0/1(P)    Gi0/2(P)    
2      Po2(SD)         LACP      Fa0/15(I)   Fa0/16(I)   

Switch31(config-if)#
01:39:50: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/16, changed state to down
01:39:50: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/15, changed state to down
Switch31(config-if)#
01:39:52: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/16, changed state to up
01:39:53: %LINK-3-UPDOWN: Interface Port-channel2, changed state to up
Switch31(config-if)#
01:39:54: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/15, changed state to up
01:39:54: %LINEPROTO-5-UPDOWN: Line protocol on Interface Port-channel2, changed state to up
Switch31(config-if)#do show ether summary
Flags:  D - down        P - bundled in port-channel
        I - stand-alone s - suspended
        H - Hot-standby (LACP only)
        R - Layer3      S - Layer2
        U - in use      f - failed to allocate aggregator

        M - not in use, minimum links not met
        u - unsuitable for bundling
        w - waiting to be aggregated
        d - default port


Number of channel-groups in use: 2
Number of aggregators:           2

Group  Port-channel  Protocol    Ports
------+-------------+-----------+-----------------------------------------------
1      Po1(SU)         LACP      Gi0/1(P)    Gi0/2(P)    
2      Po2(SU)         LACP      Fa0/15(P)   Fa0/16(P)   

Switch31(config-if)#

































Switch31 con0 is now available





Press RETURN to get started.















01:51:07: %SYS-5-CONFIG_I: Configured from console by console

User Access Verification

Password: 
Password: 
Switch31>ena
Password: 
Switch31#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch31(config)#int f0/1
Switch31(config-if)#

































Switch31 con0 is now available





Press RETURN to get started.




02:03:31: %SYS-5-CONFIG_I: Configured from console by console

User Access Verification

Password: 
Switch31>erase start
Switch31>ena        
Password: 
Switch31#erase start
Switch31#erase startup-config 
Erasing the nvram filesystem will remove all configuration files! Continue? [confirm]
[OK]
Erase of nvram: complete
Switch31#
02:12:04: %SYS-7-NV_BLOCK_INIT: Initialized the geometry of nvram
Switch31#reload

System configuration has been modified. Save? [yes/no]: no
Proceed with reload? [confirm]n
Switch31#delete flash:vlan.dat
Delete filename [vlan.dat]? 
Delete flash:vlan.dat? [confirm]
Switch31#
02:12:59: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/15, changed state to down
02:12:59: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/16, changed state to down
02:12:59: %LINEPROTO-5-UPDOWN: Line protocol on Interface Port-channel2, changed state to down
Switch31#reload
02:13:00: %LINK-3-UPDOWN: Interface FastEthernet0/15, changed state to down
02:13:00: %LINK-3-UPDOWN: Interface Port-channel2, changed state to down
02:13:00: %LINK-3-UPDOWN: Interface FastEthernet0/16, changed state to down
Switch31#reload

System configuration has been modified. Save? [yes/no]: no
Proceed with reload? [confirm]

02:13:06: %SYS-5-RELOAD: Reload requested by console. Reload Reason: Reload command.
Base ethernet MAC Address: 00:18:73:d2:55:80
Xmodem file system is available.
The password-recovery mechanism is enabled.
Initializing Flash...
flashfs[0]: 355 files, 5 directories
flashfs[0]: 0 orphaned files, 0 orphaned directories
flashfs[0]: Total bytes: 15998976
flashfs[0]: Bytes used: 11380736
flashfs[0]: Bytes available: 4618240
flashfs[0]: flashfs fsck took 17 seconds.
...done Initializing Flash.
Boot Sector Filesystem (bs) installed, fsid: 3
done.
Loading "flash:c3560-ipservices-mz.122-25.SEB4/c3560-ipservices-mz.122-25.SEB4.bin"...flash:c3560-ipservices-mz.122-25.SEB4/c3560-ipservices-mz.122-25.SEB4.bin: no such file or directory

Error loading "flash:c3560-ipservices-mz.122-25.SEB4/c3560-ipservices-mz.122-25.SEB4.bin"

Interrupt within 5 seconds to abort boot process.
Loading "flash:/c3560-advipservicesk9-mz.122-40.SE.bin"...@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
File "flash:/c3560-advipservicesk9-mz.122-40.SE.bin" uncompressed and installed, entry point: 0x3000
executing...

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, C3560 Software (C3560-ADVIPSERVICESK9-M), Version 12.2(40)SE, RELEASE SOFTWARE (fc3)
Copyright (c) 1986-2007 by Cisco Systems, Inc.
Compiled Fri 24-Aug-07 01:43 by myl
Image text-base: 0x00003000, data-base: 0x01800000

Initializing flashfs...

flashfs[1]: 355 files, 5 directories
flashfs[1]: 0 orphaned files, 0 orphaned directories
flashfs[1]: Total bytes: 15998976
flashfs[1]: Bytes used: 11380736
flashfs[1]: Bytes available: 4618240
flashfs[1]: flashfs fsck took 7 seconds.
flashfs[1]: Initialization complete....done Initializing flashfs.

POST: CPU MIC register Tests : Begin
POST: CPU MIC register Tests : End, Status Passed

POST: PortASIC Memory Tests : Begin
POST: PortASIC Memory Tests : End, Status Passed

POST: CPU MIC interface Loopback Tests : Begin
POST: CPU MIC interface Loopback Tests : End, Status Passed

POST: PortASIC RingLoopback Tests : Begin
POST: PortASIC RingLoopback Tests : End, Status Passed

POST: Inline Power Controller Tests : Begin
POST: Inline Power Controller Tests : End, Status Passed

POST: PortASIC CAM Subsystem Tests : Begin
POST: PortASIC CAM Subsystem Tests : End, Status Passed

POST: PortASIC Port Loopback Tests : Begin
POST: PortASIC Port Loopback Tests : End, Status Passed

Waiting for Port download...Complete


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C3560-24PS (PowerPC405) processor (revision P0) with 122880K/8184K bytes of memory.
Processor board ID CAT1025ZJ76
Last reset from power-on
1 Virtual Ethernet interface
24 FastEthernet interfaces
2 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00:18:73:D2:55:80
Motherboard assembly number     : 73-9673-09
Power supply part number        : 341-0029-05
Motherboard serial number       : CAT1025051E
Power supply serial number      : DTH1020DG4A
Model revision number           : P0
Motherboard revision number     : A0
Model number                    : WS-C3560-24PS-E
System serial number            : CAT1025ZJ76
Top Assembly Part Number        : 800-26380-04
Top Assembly Revision Number    : B0
Version ID                      : V06
CLEI Code Number                : COM1100ARC
Hardware Board Revision Number  : 0x01


Switch   Ports  Model              SW Version              SW Image            
------   -----  -----              ----------              ----------          
*    1   26     WS-C3560-24PS      12.2(40)SE              C3560-ADVIPSERVICESK




Press RETURN to get started!


00:00:35: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to down
00:00:36: %SPANTREE-5-EXTENDED_SYSID: Extended SysId enabled for type vlan
00:00:58: %SYS-5-RESTART: System restarted --
Cisco IOS Software, C3560 Software (C3560-ADVIPSERVICESK9-M), Version 12.2(40)SE, RELEASE SOFTWARE (fc3)
Copyright (c) 1986-2007 by Cisco Systems, Inc.
Compiled Fri 24-Aug-07 01:43 by myl
00:00:59: %LINK-3-UPDOWN: Interface FastEthernet0/15, changed state to up
00:00:59: %LINK-3-UPDOWN: Interface FastEthernet0/16, changed state to up
00:01:00: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/15, changed state to up
00:01:00: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/16, changed state to up
00:01:22: %LINK-3-UPDOWN: Interface FastEthernet0/23, changed state to up
00:01:23: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/23, changed state to up
00:01:30: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
00:01:32: %LINK-3-UPDOWN: Interface GigabitEthernet0/1, changed state to up
00:01:32: %LINK-3-UPDOWN: Interface GigabitEthernet0/2, changed state to up
00:01:33: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up
